Configuration/DataProcessors/бит_ум_СформироватьАвансовыеПлатежиНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ум_СформироватьАвансовыеПлатежиНДФЛ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйПериод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квитанция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ум_КвитанцияЗаПатент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СформированныйДокумент</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУведомления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерУведомления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодНалоговогоОргана</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Configuration/AccumulationRegisters/бит_ум_ОплатаПатентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ум_ОплатаПатентов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Configuration/InformationRegisters/бит_ум_ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ум_ПодтверждениеПраваНаУменьшениеСуммыНДФЛ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаУведомления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговыйПериод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/DataProcessors/бит_ум_СформироватьАвансовыеПлатежиНДФЛ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// Процедура заполнения табличной части.
//
Процедура ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища) Экспорт
	
	ДанныеДляЗаполнения = Новый Структура;
	
	ТаблицаСписокПлатежей = СтруктураПараметров.ТаблицаСписокПлатежей;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("НалоговыйПериод", СтруктураПараметров.НалоговыйПериод);
	Запрос.УстановитьПараметр("НачалоПериода", ?(ЗначениеЗаполнено(СтруктураПараметров.Период),
		СтруктураПараметров.Период.ДатаНачала, Неопределено));
	Запрос.УстановитьПараметр("КонецПериода", ?(ЗначениеЗаполнено(СтруктураПараметров.Период),
		КонецДня(СтруктураПараметров.Период.ДатаОкончания), Неопределено));
	Запрос.УстановитьПараметр("НачалоПериодаГраница", ?(ЗначениеЗаполнено(СтруктураПараметров.Период),
		Новый Граница(СтруктураПараметров.Период.ДатаНачала, ВидГраницы.Включая), Неопределено));
	Запрос.УстановитьПараметр("КонецПериодаГраница", ?(ЗначениеЗаполнено(СтруктураПараметров.Период),
		Новый Граница(КонецДня(СтруктураПараметров.Период.ДатаОкончания), ВидГраницы.Включая), Неопределено));
	Запрос.УстановитьПараметр("ПериодВзаиморасчетовНачало", ?(ЗначениеЗаполнено(СтруктураПараметров.ПериодВзаиморасчетов),
		НачалоМесяца(СтруктураПараметров.ПериодВзаиморасчетов), Неопределено));
	Запрос.УстановитьПараметр("ПериодВзаиморасчетовКонец", ?(ЗначениеЗаполнено(СтруктураПараметров.ПериодВзаиморасчетов),
		КонецМесяца(СтруктураПараметров.ПериодВзаиморасчетов), Неопределено));
	  
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АвансовыйПлатежИностранцаПоНДФЛ.Ссылка КАК Документ,
	|	АвансовыйПлатежИностранцаПоНДФЛ.Организация КАК Организация,
	|	АвансовыйПлатежИностранцаПоНДФЛ.Сотрудник КАК Сотрудник,
	|	АвансовыйПлатежИностранцаПоНДФЛ.Сумма,
	|	АвансовыйПлатежИностранцаПоНДФЛ.ДатаОперации,
	|	АвансовыйПлатежИностранцаПоНДФЛ.Дата КАК ДатаДокумента
	|ПОМЕСТИТЬ АвансовыйПлатежИностранцаПоНДФЛ
	|ИЗ
	|	Документ.АвансовыйПлатежИностранцаПоНДФЛ КАК АвансовыйПлатежИностранцаПоНДФЛ
	|ГДЕ
	|	АвансовыйПлатежИностранцаПоНДФЛ.НалоговыйПериод = &НалоговыйПериод
	|	И АвансовыйПлатежИностранцаПоНДФЛ.Организация = &Организация
	|	И АвансовыйПлатежИностранцаПоНДФЛ.ПометкаУдаления = ЛОЖЬ
	|	И (&НачалоПериода = НЕОПРЕДЕЛЕНО ИЛИ АвансовыйПлатежИностранцаПоНДФЛ.Дата >= &НачалоПериода)
	|	И (&КонецПериода = НЕОПРЕДЕЛЕНО ИЛИ АвансовыйПлатежИностранцаПоНДФЛ.Дата <= &КонецПериода)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОплатаПатентов.Регистратор КАК Квитанция,
	|	ОплатаПатентов.СуммаОборот КАК Сумма,
	|	ОплатаПатентов.Организация КАК Организация,
	|	ОплатаПатентов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОплатаПатентов.Период КАК ДатаКвитанции
	|ПОМЕСТИТЬ ОплатаПатентов
	|ИЗ
	|	РегистрНакопления.бит_ум_ОплатаПатентов.Обороты(
	|			&НачалоПериодаГраница,
	|			&КонецПериодаГраница,
	|			Регистратор,
	|			Организация = &Организация
	|				И (ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетовНачало И &ПериодВзаиморасчетовКонец
	|					ИЛИ &ПериодВзаиморасчетовНачало = НЕОПРЕДЕЛЕНО)) КАК ОплатаПатентов
	|ГДЕ
	|	ОплатаПатентов.СуммаОборот > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА АвансовыйПлатежИностранцаПоНДФЛ.Документ ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Пометка,
	|	ОплатаПатентов.Организация,
	|	ОплатаПатентов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОплатаПатентов.ДатаКвитанции КАК ДатаОперации,
	|	ОплатаПатентов.Сумма,
	|	ОплатаПатентов.Квитанция,
	|	ЕСТЬNULL(АвансовыйПлатежИностранцаПоНДФЛ.Документ, ЗНАЧЕНИЕ(Документ.АвансовыйПлатежИностранцаПоНДФЛ.ПустаяСсылка)) КАК СформированныйДокумент,
	|	ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.ДатаУведомления,
	|	ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.НомерУведомления,
	|	ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.КодНалоговогоОргана
	|ИЗ
	|	ОплатаПатентов КАК ОплатаПатентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ АвансовыйПлатежИностранцаПоНДФЛ КАК АвансовыйПлатежИностранцаПоНДФЛ
	|		ПО ОплатаПатентов.Организация = АвансовыйПлатежИностранцаПоНДФЛ.Организация
	|			И ОплатаПатентов.ФизическоеЛицо = АвансовыйПлатежИностранцаПоНДФЛ.Сотрудник
	|			И (НАЧАЛОПЕРИОДА(ОплатаПатентов.ДатаКвитанции, ДЕНЬ) = АвансовыйПлатежИностранцаПоНДФЛ.ДатаОперации)
	|			И ОплатаПатентов.Сумма = АвансовыйПлатежИностранцаПоНДФЛ.Сумма
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ум_ПодтверждениеПраваНаУменьшениеСуммыНДФЛ КАК ПодтверждениеПраваНаУменьшениеСуммыНДФЛ
	|		ПО ОплатаПатентов.Организация = ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.Организация
	|			И ОплатаПатентов.ФизическоеЛицо = ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.ФизическоеЛицо
	|			И (ПодтверждениеПраваНаУменьшениеСуммыНДФЛ.НалоговыйПериод = &НалоговыйПериод)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОплатаПатентов.ФизическоеЛицо.Наименование,
	|	ДатаОперации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаСписокПлатежей.Добавить(), Выборка);
	КонецЦикла;
	
	ДанныеДляЗаполнения.Вставить("ТаблицаСписокПлатежей", ТаблицаСписокПлатежей);
	
	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);
	
КонецПроцедуры

// Формирует документы "Авансовый платеж по НДФЛ" на основании помеченных строк
// табличной части.
//
Процедура СформироватьДокументыАвансовыйПлатежИностранцаПоНДФЛ(СтруктураПараметров, АдресХранилища) Экспорт
	
	ДанныеДляЗаполнения = Новый Структура;
	
	ТаблицаСписокПлатежей = СтруктураПараметров.ТаблицаСписокПлатежей;
	
	СформированныеДокументы = Новый Массив;
	
	ЕстьРегистрРеквизитов = Метаданные.РегистрыСведений.Найти("РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей") <> Неопределено;
	
	Для Каждого СтрокаТаблицы Из ТаблицаСписокПлатежей Цикл
		
		Если НЕ СтрокаТаблицы.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.СформированныйДокумент) Тогда
			ДокументОбъект = СтрокаТаблицы.СформированныйДокумент.ПолучитьОбъект();
		Иначе
			ДокументОбъект = Документы.АвансовыйПлатежИностранцаПоНДФЛ.СоздатьДокумент();
		КонецЕсли;
		
		ДокументОбъект.Дата = СтрокаТаблицы.ДатаОперации;
		ДокументОбъект.ДатаОперации = СтрокаТаблицы.ДатаОперации;
		ДокументОбъект.НалоговыйПериод = СтруктураПараметров.НалоговыйПериод;
		ДокументОбъект.Организация = СтруктураПараметров.Организация;
		ДокументОбъект.Сотрудник = СтрокаТаблицы.ФизическоеЛицо;
		ДокументОбъект.Сумма = СтрокаТаблицы.Сумма;
		ДокументОбъект.Ответственный = СтруктураПараметров.Ответственный;
		
		Попытка
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			Если ЕстьРегистрРеквизитов Тогда
				НаборЗаписей = РегистрыСведений.РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Год.Установить(СтруктураПараметров.НалоговыйПериод);
				НаборЗаписей.Отбор.ГоловнаяОрганизация.Установить(ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(СтруктураПараметров.Организация));
				НаборЗаписей.Отбор.ФизическоеЛицо.Установить(СтрокаТаблицы.ФизическоеЛицо);
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы, "ДатаУведомления, НомерУведомления, КодНалоговогоОргана, ФизическоеЛицо");
				Запись.Год = СтруктураПараметров.НалоговыйПериод;
				Запись.ГоловнаяОрганизация = ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(СтруктураПараметров.Организация);
				НаборЗаписей.Записать();
			КонецЕсли;
				
			ЗафиксироватьТранзакцию();
			
			СформированныеДокументы.Добавить(Новый Структура("НомерСтроки, СформированныйДокумент",
				СтрокаТаблицы.НомерСтроки, ДокументОбъект.Ссылка));
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'При формировании документа по строке №%1 произошла ошибка:
		                           |%2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаТаблицы.НомерСтроки,
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));

		КонецПопытки;
		
	КонецЦикла;
	
	ДанныеДляЗаполнения.Вставить("СформированныеДокументы", СформированныеДокументы);
	
	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти	
	
#КонецЕсли
